[
    "There is telling of a dangerous cave nearby, holding immense riches. ",
    "There is a rumor of riches stored in a nearby cave. ",
    "You found a small clearing. ",
    "A bridge crosses over a deep gorge. ",
    "This town's inn looks very inviting. ",
    "A trail winds up the side of a mountain. ",
    "You hear a rumor of a treasure outside the town. ",
    "You found a clearing with sunshine streaming in from above. ",
    "The remains of some sort of ritual can be found ahead. ",
    "There is rumor of an adventurer's demise over the next hill. ",
    "A small path can be seen heading into some brush. ",
    "An overgrown grove lies ahead. ",
    "A deserted ritual space can be seen ahead. ",
    "The path widens and there is a small field. ",
    "You spy an ancient-looking chest resting against a tree. ",
    "The path ahead winds down into a valley below. ",
    "The birds and animals around you suddenly have gone silent. ",
    "There is a rumor that a rich dragon lives nearby. ",
    "You stumble upon a small grotto. ",
    "A thin, rickety wooden bridge stretches across a canyon. ",
    "You find a cave entrance covered in moss. ",
    "Thin tendrils of fog are starting to creep across the path. ",
    "There is a rumor of an ancient treasure nearby. ",
    "A small glittering object can be seen ahead on the side of the path. ",
    "The path opens up into a clearing, and fresh bones can be seen in the grass. ",
    "The path starts to thin and the trees feel like they are starting to reach towards you. ",
    "A mossy stone altar can be seen ahead. ",
    "A massive, short block of intricately-carved stone can be seen on the side of the path. ",
    "You hear a strange noise, unlike any animal you've heard before. ",
    "The birds suddenly stop singing and the silence in the forest is deafening. An open clearing lies ahead. ",
    "Rusty metal scraps are strewn about on the path ahead. ",
    "You stumble across the very fresh remains of another unfortunate adventurer. ",
    "A small trail winds deeper into the forest. "
]
